{
  "tasks": [
    {
      "id": "T-001",
      "title": "Scaffold Vite + Three.js app and verify local boot",
      "status": "done",
      "size": "small",
      "milestone": "v0",
      "notes": "Vite project initialized with Three.js, npm deps installed, and production build passes."
    },
    {
      "id": "T-002",
      "title": "Add basic WASD player controller with follow camera",
      "status": "done",
      "size": "small",
      "milestone": "v0",
      "notes": "Arrow key movement (forward/left/right), jump on Space, animation state blending (idle/walk/jump), and smooth camera follow implemented."
    },
    {
      "id": "T-003",
      "title": "Set up CI build check workflow",
      "status": "done",
      "size": "small",
      "milestone": "v0",
      "notes": "Added GitHub Actions workflow at .github/workflows/ci-build.yml to run npm ci + npm run build on push and pull_request."
    },
    {
      "id": "T-004",
      "title": "Integrate boy model and external FBX animation clips (load model once, retarget clips)",
      "status": "done",
      "size": "small",
      "milestone": "v1",
      "notes": "Integrated latest repo assets from 3d_models/boy. Player rig/model is loaded once from Sad Idle.fbx, with Walking.fbx and Jumping.fbx loaded separately and retargeted via SkeletonUtils.retargetClip."
    },
    {
      "id": "T-005",
      "title": "Polish world visuals with sky gradient and floor styling",
      "status": "done",
      "size": "small",
      "milestone": "v1",
      "notes": "Gradient sky styling, fog, directional/hemisphere lighting, and stylized green floor/grid added."
    },
    {
      "id": "T-006",
      "title": "Pull latest remote assets and verify /3d_models/boy FBX files are present",
      "status": "done",
      "size": "small",
      "milestone": "v1",
      "notes": "Merged origin/main commit with FBX assets: Sad Idle.fbx, Walking.fbx, Jumping.fbx."
    },
    {
      "id": "T-007",
      "title": "Tune animation blend timings and movement mapping for forward/left/right/jump with actual FBX clips",
      "status": "done",
      "size": "small",
      "milestone": "v1",
      "notes": "Updated runtime to consume real FBX files via Vite asset URLs and validated build output with included animation assets."
    },
    {
      "id": "T-008",
      "title": "Fix character visibility and animation binding stability with real FBX assets",
      "status": "done",
      "size": "small",
      "milestone": "v1",
      "notes": "Normalized character scale/grounding, reframed camera after load, and switched walk/jump to direct clip binding for this rig family."
    },
    {
      "id": "T-009",
      "title": "Capture deterministic animation verification screenshots (idle/forward/right/jump) via Playwright",
      "status": "done",
      "size": "small",
      "milestone": "v1",
      "notes": "Generated validation screenshots in artifacts/ and delivered images one-by-one in Telegram."
    },
    {
      "id": "T-010",
      "title": "Commit and push latest scene + validation artifacts to main",
      "status": "done",
      "size": "small",
      "milestone": "v1",
      "notes": "Committed runtime + CI + validation scripts/artifacts and pushed to origin/main."
    },
    {
      "id": "T-011",
      "title": "Add simple ground-plane terrain placeholder variations (color + subtle height illusion)",
      "status": "done",
      "size": "small",
      "milestone": "v1",
      "notes": "Replaced flat floor with a subdivided terrain plane using subtle procedural undulation + per-vertex grass color variation, plus a faint wireframe contour overlay for readability."
    },
    {
      "id": "T-012",
      "title": "Implement basic gravity + floor collision lock for player movement",
      "status": "done",
      "size": "small",
      "milestone": "v1",
      "notes": "Aligned player grounding/jump landing with procedural terrain height sampling so movement hugs terrain and gravity resolves to local floor instead of hardcoded y=0."
    },
    {
      "id": "T-013",
      "title": "Add one basic interactable object with proximity trigger and on-screen prompt",
      "status": "done",
      "size": "small",
      "milestone": "v1",
      "notes": "Added a glowing orb pedestal interactable with proximity-gated \"Press E\" prompt and a status toast when toggled."
    },
    {
      "id": "T-014",
      "title": "Add automation instruction .md files for programmer/reviewer/playtest/status cron jobs",
      "status": "done",
      "size": "small",
      "milestone": "v1",
      "notes": "Created automation/*.md and aligned cron payloads to reference these files."
    },
    {
      "id": "T-015",
      "title": "Implement slow mode for deterministic playtesting and screenshots",
      "status": "done",
      "size": "small",
      "milestone": "v1",
      "notes": "Added ?slow=1 URL mode plus T key toggle with HUD indicator; movement/animation updates now scale by time factor."
    },
    {
      "id": "T-016",
      "title": "Establish first art-direction pass: mood/palette/prop style and 2-3 asset candidates",
      "status": "done",
      "size": "small",
      "milestone": "v1",
      "notes": "Completed first art-direction pass: documented mood/palette/prop style and 3 CC0 asset candidates in docs/art-direction-pass-01.md; implemented dusk palette tuning + lightweight set-dressing prop clusters in scene for immediate visual coherence."
    },
    {
      "id": "T-017",
      "title": "Replace primitive set-dressing cluster with 1 imported CC0 nature-kit asset bundle (optimized glTF) and measure build size delta",
      "status": "done",
      "size": "small",
      "milestone": "v1",
      "notes": "Replaced primitive set-dressing with imported Kenney Nature Kit (CC0) GLB props (tree_oak, rock_smallE, log_stackLarge), loaded via GLTFLoader with shadow-ready cloning and primitive fallback. Asset payload kept minimal at +38,180 bytes raw (+12,435 bytes gzip) in public/assets/nature-kit. npm run build passes."
    },
    {
      "id": "T-018",
      "title": "Prototype 2-4 terrain chunks with distance-based visibility toggle",
      "status": "done",
      "size": "small",
      "milestone": "v2",
      "notes": "Split terrain into 4 procedural chunks (2x2 grid) and added runtime distance-based visibility culling per chunk for both floor + contour overlays using player/camera position."
    },
    {
      "id": "T-019",
      "title": "Add debug HUD showing active chunk count and player chunk index",
      "status": "done",
      "size": "small",
      "milestone": "v2",
      "notes": "Added top-left chunk HUD that updates every frame with visible chunk count and player chunk index in the 2x2 terrain grid (or out-of-grid when outside bounds)."
    },
    {
      "id": "T-020",
      "title": "Playtest chunk prototype in slow mode and capture 3 validation screenshots",
      "status": "done",
      "size": "small",
      "milestone": "v2",
      "notes": "Ran slow-mode chunk playtest via scripts/playtest-chunk-screens.cjs against vite preview after fresh build. Captured deterministic screenshots: artifacts/chunk-playtest-1-spawn.png, artifacts/chunk-playtest-2-midwalk.png, artifacts/chunk-playtest-3-near-edge.png."
    },
    {
      "id": "T-021",
      "title": "Art pass: shift terrain + fog to a cohesive dusk palette and add subtle distance color grading",
      "status": "done",
      "size": "small",
      "milestone": "v2",
      "notes": "Shifted scene to a dusk look: updated sky/background gradient, cooler hemisphere light + warmer key directional light, retuned fog near/far/color, and moved terrain/contour vertex colors toward cool-foreground to warm-distant separation."
    },
    {
      "id": "T-022",
      "title": "Asset integration: add 2-3 low-poly landmark props (windmill/ruin/tower) from Poly Pizza with explicit per-model license notes",
      "status": "done",
      "size": "small",
      "milestone": "v2",
      "notes": "Imported two Poly Pizza landmark GLBs into public/assets/poly-pizza (Tower CC0 + Windmill CC BY 3.0) and wired them into landmark spawning with primitive fallbacks preserved for robustness. Added docs/assets-license-notes.md with source URL + exact license strings + explicit attribution text for CC BY windmill. Deferred Modular Ruins Pack this pass because its GLB payload is too large for the ~300KB gzip budget target."
    },
    {
      "id": "T-023",
      "title": "Reviewer + playtest visual readability check (silhouette, horizon contrast, landmark discoverability)",
      "status": "ready",
      "size": "small",
      "milestone": "v2",
      "notes": "Review against art goals in slow mode with screenshots at near/mid/far camera distances. Confirm player silhouette remains legible against terrain and fog, and landmarks are visible from spawn. Reference palette/asset constraints from Kenney CC0 nature kit https://kenney.nl/assets/nature-kit and ambientCG CC0 materials https://ambientcg.com."
    },
    {
      "id": "T-024",
      "title": "Programmer: stage one landmark composition pass (tower + ruins + windmill fallback) with silhouette-first placement",
      "status": "done",
      "size": "small",
      "milestone": "v2",
      "notes": "Staged first landmark composition pass directly in scene code with three silhouette-first anchors from spawn: near tower (20,-14), mid ruins (-46,24), and far windmill fallback (74,62). Each landmark uses only two shared material variants (stone/accent) with reused primitive meshes and terrain-aligned placement to keep draw/asset cost low ahead of external model import in T-022."
    },
    {
      "id": "T-025",
      "title": "Reviewer: validate asset-license ledger + art-style cohesion for newly imported landmarks",
      "status": "ready",
      "size": "small",
      "milestone": "v2",
      "notes": "Check docs/assets-license-notes.md includes source URL + exact license string per model (CC0 vs CC-BY). If any CC-BY model (e.g., Windmill https://poly.pizza/m/ctIRaIM3zXu) is used, verify attribution text is present in-project. Confirm landmarks read as stylized/low-poly and do not clash with character proportions."
    },
    {
      "id": "T-026",
      "title": "Playtest: run landmark discoverability route and capture readability screenshots (spawn, mid-path, landmark base)",
      "status": "ready",
      "size": "small",
      "milestone": "v2",
      "notes": "In ?slow=1 mode, walk a fixed route toward each landmark and capture 3 screenshots per landmark distance bucket. Fail criteria: player silhouette blends into fog/terrain or landmark not visible from spawn within 5 seconds of camera scan."
    },
    {
      "id": "T-027",
      "title": "Programmer: apply Twilight-5-driven dusk grade and landmark rim-light accents for silhouette readability",
      "status": "done",
      "size": "small",
      "milestone": "v2",
      "notes": "Applied Twilight-5 palette mapping in runtime: scene background/fog + hemisphere/directional lights + terrain vertex ramp + contour tint now use #fbbbad/#ee8695/#4a7a96/#333f58/#292831 while preserving existing fog near/far distances (24/106). Added subtle warm rim accent shader patch (onBeforeCompile) for landmark materials only (primitive and imported GLB landmark meshes) to improve silhouette readability without changing non-landmark assets. npm run build passes."
    },
    {
      "id": "T-028",
      "title": "Reviewer: verify candidate ruins asset pack feasibility (license + payload budget) before import",
      "status": "done",
      "size": "small",
      "milestone": "v2",
      "notes": "Audited Modular Ruins Pack source/license and measured payload feasibility. Candidate GLB URL resolved from page metadata to static.poly.pizza/fa6cf69d-a091-4eb7-b62e-56290d8b9097.glb (CC0). Size check: 7,965,364 bytes raw and ~2,701,915 bytes gzip versus current landmark baseline ~299,400 bytes gzip. Marked as over budget and documented decision to avoid full-pack import; future work must selectively extract 1-2 pieces and re-measure before merge in docs/assets-license-notes.md."
    },
    {
      "id": "T-029",
      "title": "Playtest: run dusk readability route after palette update and score silhouette/horizon clarity",
      "status": "ready",
      "size": "small",
      "milestone": "v2",
      "notes": "Using ?slow=1, capture spawn/mid/far screenshots before and after T-027. Score 1-5 for (a) player silhouette against terrain, (b) landmark recognizability at spawn, (c) horizon separation through fog. Reference currently used assets: Kenney Nature Kit CC0 https://kenney.nl/assets/nature-kit and Poly Pizza windmill CC BY 3.0 https://poly.pizza/m/ctIRaIM3zXu (ensure attribution remains visible in docs)."
    },
    {
      "id": "T-030",
      "title": "Programmer: add 1 lightweight CC0 ground material set (dirt + grass) and wire distance fade blend",
      "status": "done",
      "size": "small",
      "milestone": "v2",
      "notes": "Implemented lightweight dual ground material set using in-code tiling grass+dirt textures (128x128 CanvasTexture each, zero external payload) and wired distance-based shader blend tied to camera range for near-grass/far-dirt readability within dusk palette. Updated terrain material pipeline with per-frame camera uniform updates. npm run build passes."
    },
    {
      "id": "T-031",
      "title": "Reviewer: verify new material pass keeps stylized cohesion and budget",
      "status": "ready",
      "size": "small",
      "milestone": "v2",
      "notes": "Check that added ground textures do not push scene toward photoreal mismatch against low-poly props. Confirm build-size delta and that far-distance fog/horizon readability remains equal or better than T-029 baseline. License note must cite Poly Haven CC0 https://polyhaven.com/license in docs/assets-license-notes.md if assets are imported."
    },
    {
      "id": "T-032",
      "title": "Playtest: run golden-hour readability sweep after material blend pass",
      "status": "ready",
      "size": "small",
      "milestone": "v2",
      "notes": "In ?slow=1 mode capture spawn/mid/far screenshots plus one landmark-approach frame. Score 1-5 for player silhouette contrast, landmark edge separation, and terrain noise distraction. Pass only if readability score average >=4 and no new aliasing shimmer appears while moving."
    },
    {
      "id": "T-033",
      "title": "Programmer: import 1-2 micro ruin accent props (CC0) and place near mid/far landmark paths for depth cues",
      "status": "done",
      "size": "small",
      "milestone": "v2",
      "notes": "Imported both researched CC0 Poly Pizza accents into public/assets/poly-pizza (Damaged Grave https://poly.pizza/m/KWtVNrHXVR, Broken Fence Pillar https://poly.pizza/m/8RXyLygEeF) and placed 4 instances along mid/far landmark approach lanes in createSetDressing. Added primitive fallback placement path. Measured gzip payload delta at +36,225 bytes (<= 60KB target)."
    },
    {
      "id": "T-034",
      "title": "Reviewer: audit new ruin accents for license compliance + composition noise",
      "status": "ready",
      "size": "small",
      "milestone": "v2",
      "notes": "Verify docs/assets-license-notes.md includes source URL + exact license strings for every newly imported ruin accent. Confirm added props improve depth cues without cluttering traversal lanes or competing with tower/windmill silhouettes from spawn."
    },
    {
      "id": "T-035",
      "title": "Playtest: run silhouette/readability pass with new ruin accents at dusk",
      "status": "ready",
      "size": "small",
      "milestone": "v2",
      "notes": "Use ?slow=1 and capture 4 screenshots (spawn, mid-path, near ruin accent, near landmark). Score 1-5 for player silhouette contrast and landmark discoverability; fail if accents create navigation confusion or reduce average readability below 4."
    },
    {
      "id": "T-036",
      "title": "Programmer: add foreground framing pass (2 tree clusters + 1 rock cluster) to improve depth at spawn",
      "status": "done",
      "size": "small",
      "milestone": "v2",
      "notes": "Added a foreground framing pass in createSetDressing using existing Kenney Nature Kit assets already loaded in-scene: two near-spawn tree clusters (left/right) plus one low rock cluster, with supplemental small rocks at each tree anchor. Placement keeps the central forward lane open for traversal while improving spawn depth cues. No new external assets added; build passes."
    },
    {
      "id": "T-037",
      "title": "Reviewer: evaluate dusk value hierarchy after framing pass (player/landmark/foreground separation)",
      "status": "ready",
      "size": "small",
      "milestone": "v2",
      "notes": "Review screenshots at spawn and mid-path after T-036. Score 1-5 for value separation between (a) player, (b) primary landmark, (c) new foreground props. Fail if foreground props compete with landmark silhouettes or obscure navigation cues. Palette anchor remains Twilight-5 (#fbbbad #ee8695 #4a7a96 #333f58 #292831, https://lospec.com/palette-list/twilight-5)."
    },
    {
      "id": "T-038",
      "title": "Playtest: run 60-second first-impression route and verify landmark readability with added foreground dressing",
      "status": "ready",
      "size": "small",
      "milestone": "v2",
      "notes": "In ?slow=1 mode, perform fixed 60-second route from spawn to nearest landmark and capture 4 frames (0s, 20s, 40s, 60s). Pass criteria: average readability >=4/5 and no new pop-in distraction. Keep license ledger reference intact for current sources: Kenney Nature Kit CC0 https://kenney.nl/assets/nature-kit and Poly Pizza CC0 accents (e.g., Damaged Grave https://poly.pizza/m/KWtVNrHXVR, Broken Fence Pillar https://poly.pizza/m/8RXyLygEeF)."
    },
    {
      "id": "T-039",
      "title": "Programmer: lock spawn camera to horizon-first framing and add subtle sun-disc gradient cue",
      "status": "ready",
      "size": "small",
      "milestone": "v2",
      "notes": "Current spawn framing can open on mostly sky; set initial camera pitch/target clamp so terrain + one landmark are visible within first second. Add a lightweight sky sun-disc/radial gradient (shader or sprite, no HDRI) using Twilight-5 anchors (#fbbbad #ee8695 #4a7a96 #333f58 #292831, https://lospec.com/palette-list/twilight-5). Keep GPU cost negligible and preserve fog readability."
    },
    {
      "id": "T-040",
      "title": "Reviewer: verify first-5-seconds composition readability after spawn-framing pass",
      "status": "ready",
      "size": "small",
      "milestone": "v2",
      "notes": "Capture 3 deterministic spawn screenshots (0s/2s/5s) in ?slow=1 and score 1-5 for: horizon balance, player silhouette contrast, and immediate landmark discoverability. Pass criteria: average >=4 and at least one landmark clearly legible at 0-2s without camera spin."
    },
    {
      "id": "T-041",
      "title": "Playtest: run 90-second landmark orientation test with first-impression scoring",
      "status": "ready",
      "size": "small",
      "milestone": "v2",
      "notes": "From fresh load in ?slow=1, run fixed 90-second route: spawn scan (10s), move toward nearest landmark (40s), pivot to second landmark (40s). Record 5 frames and score orientation clarity/readability. Keep license context intact for active assets: Kenney Nature Kit CC0 https://kenney.nl/assets/nature-kit and Poly Pizza Windmill CC BY https://poly.pizza/m/ctIRaIM3zXu (attribution required)."
    }
  ]
}
